#+TITLE: Shell Field Guide
#+AUTHOR: Raimon Grau
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t todo:t |:t
#+EXCLUDE_TAGS: noexport
#+KEYWORDS: bash zsh shell
#+LANGUAGE: en
#+SELECT_TAGS: export

#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

#+OPTIONS: reveal_center:nil timestamp:nil
#+REVEAL_THEME: black

# toc:nil num:nil

** Variables
   By default variables are global, to a file. No matter if you assign
   them for the first time inside a function, or at the top level.
   #+begin_src bash
   foo=3
   bar=$foo
   f() {
     echo $bar
   }
   f
   #+end_src

   #+RESULTS:
   : 3

   #+begin_src bash
   f() {
     bar=1
   }
   f
   echo $bar
   #+end_src

   #+RESULTS:
   : 1

   You make a variable local to a function with =local=. Use it as
   much as you can (kinda obvious).
   #+begin_src bash
   myfun() {
     local bar
     bar=3
     echo $bar
   }

   bar=4
   echo $bar
   myfun
   echo $bar
   #+end_src

   #+RESULTS:
   | 4 |
   | 3 |
   | 4 |
** Interpolation
   We previously saw that functions can be passed around as strings,
   and be called later on.

   Something that might not be obvious is that the string can be
   created from shorter strings, and that allows for an extra
   flexibility, that comes with its own dangers, but it's a very
   useful pattern to dispatch functions based on user input or
   function outputs.
   #+begin_src bash
   l=l
   s=s
   $l$s .
   #+end_src

   #+RESULTS:
   | book.html  |
   | book.html~ |
   | book.org   |
   | readme.org |

